// Напишите программу, которая запрашивает у пользователя два числа и 
// операцию (+, -, * или /). Затем объявите функцию, которая принимает два числа и операцию как параметры 
// и выводит на экран результат выполнения выбранной операции. Если пользователь ввел неверный оператор, 
// программа выводит "Неверный оператор"
// let n1 = Number(prompt("Введите первое число:"));
// let n2 = Number(prompt("Введите второе число:"));
// let a = prompt("Введите операцию (+, -, *, /):");
// let result;

// function am(n1, n2, a)
// {
//     if (a === "+")
//     {
//         result = n1 + n2;
//     }
//     else if (a === "-")
//     {
//         result = n1 - n2;
//     }
//     else if (a === "*")
//     {
//         result = n1 * n2;
//     }
//     else if (a === "/")
//     {
//         result = n1 / n2;
//     }
//     else
//     {
//         result = "Неверный оператор";
//     }
//     console.log(result);
// }

// am(n1, n2, a);

// // Напишите программу, которая запрашивает у пользователя четыре числа и объявляет функцию compareAndPrintMax. 
// // Эта функция принимает четыре числа как параметры и сравнивает их, затем выводит сообщение о том, какое число больше.

// let a = +(prompt("Введите число:"));
// let b = +(prompt("Введите число:"));
// let c = +(prompt("Введите число:"));
// let d = +(prompt("Введите число:"));

// function compareAndPrintMax(a, b, c, d) {

//     if(a > b  &&  a > c  &&  a > d){

//     console.log(a);}

//     else if(b  >  a  &&  b > c  &&  b > d){

//     console.log(b);}

//     else if(c  >  a  &&  c  >  b  &&  c  >  d){

//     console.log(c);}

//     else{console.log(d);}

// }

// compareAndPrintMax(a, b, c, d);

// // Напишите программу, которая запрашивает у пользователя два числа и сравнивает их. 
// // Затем объявите функцию, которая принимает два числа как параметры и выводит на экран сообщение о том, какое число больше.

// let a = Number(prompt("Введите первое число: "));
// let b = Number(prompt("Введите второе число: "));
// function func(a, b) {
//     if (a > b) {
//     return a + ' больше, чем ' + b;
//     }
//     else if ( a == b){
//     return b + ' равно ' + a;
//     }
//     else {
//     return b + ' больше, чем ' + a;
//     }
// }
// let result = func (a, b);
// console.log (result);
