// Создайте объект book с информацией о книге. Попросите пользователя ввести следующие данные о книге:

// Название книги.
// Автор книги.
// Год издания книги.
// Затем напишите программу, которая использует этот объект для вывода информации о книге в заявленном формате.


// let name = prompt();
// let author = prompt();
// let year = prompt();
// const book = {
//     name,
//     author,
//     year,
// };
// console.log("Название книги: " + book.name)
// console.log("Автор книги: " + book.author)
// console.log("Год издания книги: " + book.year)



// Перед вами объект catalogue, в котором содержится свойство magazine: 5. 
// Удалите это свойство из объекта и добавьте в объект свойство newspaper с числовым значением, 
// которое пользователь вводит самостоятельно. Выведите значение свойства newspaper. 


// let b = +prompt();
// const catalogue = {
//     magazine: 5,
// }
// delete catalogue.magazine;
// catalogue.newspaper = b;
// console.log(catalogue.newspaper);

// Перед вами объект catalogue, в котором содержится свойство magazine: 5. 
// Измените значение этого свойства на вводимое пользователем числовое значение и выведите его, 
// но только если оно не меньше 10 и не больше 50. 
// Если введенное значение находится вне данного диапазона, сообщите об этом пользователю в заявленном формате. 

// const catalogue = {
//     magazine: 5,
// }
// catalogue.magazine = +prompt();
// console.log((catalogue.magazine>=10 && catalogue.magazine<=50)?catalogue.magazine:'Введите число в диапазоне от 10 до 50 включительно');

